const fakedata = [
  {
    "name": "红军",
    "weight": 19.467922333931785
  },
  {
    "name": "中国",
    "weight": 19.1049731745428
  },
  {
    "name": "共产党",
    "weight": 15.905973720586866
  },
  {
    "name": "国民党",
    "weight": 13.527749258468683
  },
  {
    "name": "南京",
    "weight": 12.727922061357855
  },
  {
    "name": "蒋介石",
    "weight": 12.12435565298214
  },
  {
    "name": "日本",
    "weight": 11.090536506409418
  },
  {
    "name": "毛泽东",
    "weight": 10.099504938362077
  },
  {
    "name": "西北",
    "weight": 9.591663046625438
  },
  {
    "name": "苏维埃",
    "weight": 8.366600265340756
  },
  {
    "name": "江西",
    "weight": 8.246211251235321
  },
  {
    "name": "西安",
    "weight": 8.06225774829855
  },
  {
    "name": "湖南",
    "weight": 8
  },
  {
    "name": "彭德怀",
    "weight": 7.937253933193772
  },
  {
    "name": "上海",
    "weight": 7.874007874011811
  },
  {
    "name": "苏区",
    "weight": 7.681145747868608
  },
  {
    "name": "甘肃",
    "weight": 7.615773105863909
  },
  {
    "name": "张学良",
    "weight": 7.54983443527075
  },
  {
    "name": "陕西",
    "weight": 7.3484692283495345
  },
  {
    "name": "东北军",
    "weight": 6.782329983125268
  },
  {
    "name": "朱德",
    "weight": 6.48074069840786
  },
  {
    "name": "中国共产党",
    "weight": 6.48074069840786
  },
  {
    "name": "俄国",
    "weight": 6.324555320336759
  },
  {
    "name": "四川",
    "weight": 6.324555320336759
  },
  {
    "name": "周恩来",
    "weight": 6.244997998398398
  },
  {
    "name": "苏维埃",
    "weight": 6.244997998398398
  },
  {
    "name": "保安",
    "weight": 6.164414002968976
  },
  {
    "name": "徐海东",
    "weight": 6.082762530298219
  },
  {
    "name": "马克思",
    "weight": 5.916079783099616
  },
  {
    "name": "白军",
    "weight": 5.916079783099616
  },
  {
    "name": "美国",
    "weight": 5.744562646538029
  },
  {
    "name": "宁夏",
    "weight": 5.5677643628300215
  },
  {
    "name": "北京",
    "weight": 5.477225575051661
  },
  {
    "name": "苏联",
    "weight": 5.477225575051661
  },
  {
    "name": "西安府",
    "weight": 5.0990195135927845
  },
  {
    "name": "斯诺",
    "weight": 4.898979485566356
  },
  {
    "name": "德国",
    "weight": 4.898979485566356
  },
  {
    "name": "CHINA",
    "weight": 4.795831523312719
  },
  {
    "name": "长沙",
    "weight": 4.795831523312719
  },
  {
    "name": "福建",
    "weight": 4.795831523312719
  },
  {
    "name": "林彪",
    "weight": 4.58257569495584
  },
  {
    "name": "贺龙",
    "weight": 4.58257569495584
  },
  {
    "name": "广州",
    "weight": 4.58257569495584
  },
  {
    "name": "云南",
    "weight": 4.47213595499958
  },
  {
    "name": "英国",
    "weight": 4.358898943540674
  },
  {
    "name": "山西",
    "weight": 4.358898943540674
  },
  {
    "name": "红区",
    "weight": 4.358898943540674
  },
  {
    "name": "中国红军",
    "weight": 4.123105625617661
  },
  {
    "name": "陈独秀",
    "weight": 4
  },
  {
    "name": "中共",
    "weight": 3.872983346207417
  },
  {
    "name": "红军大学",
    "weight": 3.872983346207417
  },
  {
    "name": "莫斯科",
    "weight": 3.872983346207417
  },
  {
    "name": "延安",
    "weight": 3.7416573867739413
  },
  {
    "name": "长城",
    "weight": 3.7416573867739413
  },
  {
    "name": "蒙古",
    "weight": 3.7416573867739413
  },
  {
    "name": "贵州",
    "weight": 3.7416573867739413
  },
  {
    "name": "列宁",
    "weight": 3.605551275463989
  },
  {
    "name": "黄河",
    "weight": 3.605551275463989
  },
  {
    "name": "东北",
    "weight": 3.605551275463989
  },
  {
    "name": "汉口",
    "weight": 3.605551275463989
  },
  {
    "name": "李德",
    "weight": 3.4641016151377544
  },
  {
    "name": "孙中山",
    "weight": 3.4641016151377544
  },
  {
    "name": "李立三",
    "weight": 3.4641016151377544
  },
  {
    "name": "杨虎城",
    "weight": 3.3166247903554
  },
  {
    "name": "南京军队",
    "weight": 3.3166247903554
  },
  {
    "name": "华北",
    "weight": 3.3166247903554
  },
  {
    "name": "满洲",
    "weight": 3.3166247903554
  },
  {
    "name": "长江",
    "weight": 3.3166247903554
  },
  {
    "name": "徐特立",
    "weight": 3.1622776601683795
  },
  {
    "name": "何键",
    "weight": 3.1622776601683795
  },
  {
    "name": "汪精卫",
    "weight": 3.1622776601683795
  },
  {
    "name": "冯玉祥",
    "weight": 3.1622776601683795
  },
  {
    "name": "何应钦",
    "weight": 3.1622776601683795
  },
  {
    "name": "红色中国",
    "weight": 3.1622776601683795
  },
  {
    "name": "西藏",
    "weight": 3.1622776601683795
  },
  {
    "name": "意大利",
    "weight": 3.1622776601683795
  },
  {
    "name": "南昌",
    "weight": 3.1622776601683795
  },
  {
    "name": "武汉",
    "weight": 3.1622776601683795
  },
  {
    "name": "孙逸仙",
    "weight": 3
  },
  {
    "name": "李长林",
    "weight": 3
  },
  {
    "name": "外交部",
    "weight": 3
  },
  {
    "name": "苏维埃",
    "weight": 3
  },
  {
    "name": "伦敦",
    "weight": 3
  },
  {
    "name": "北平",
    "weight": 3
  },
  {
    "name": "湖南省",
    "weight": 3
  },
  {
    "name": "陕北",
    "weight": 3
  },
  {
    "name": "大渡河",
    "weight": 2.8284271247461903
  },
  {
    "name": "白区",
    "weight": 2.8284271247461903
  },
  {
    "name": "天津",
    "weight": 2.8284271247461903
  },
  {
    "name": "法国",
    "weight": 2.8284271247461903
  },
  {
    "name": "瑞金",
    "weight": 2.8284271247461903
  },
  {
    "name": "袁世凯",
    "weight": 2.6457513110645907
  },
  {
    "name": "梁启超",
    "weight": 2.6457513110645907
  },
  {
    "name": "红军剧社",
    "weight": 2.6457513110645907
  },
  {
    "name": "蓝衣社",
    "weight": 2.6457513110645907
  },
  {
    "name": "黄埔军校",
    "weight": 2.6457513110645907
  },
  {
    "name": "陕西省",
    "weight": 2.6457513110645907
  },
  {
    "name": "洛川",
    "weight": 2.6457513110645907
  },
  {
    "name": "西南",
    "weight": 2.6457513110645907
  },
  {
    "name": "广东",
    "weight": 2.6457513110645907
  },
  {
    "name": "中华",
    "weight": 2.6457513110645907
  },
  {
    "name": "印度",
    "weight": 2.6457513110645907
  },
  {
    "name": "绥远",
    "weight": 2.6457513110645907
  },
  {
    "name": "唐生智",
    "weight": 2.449489742783178
  },
  {
    "name": "康有为",
    "weight": 2.449489742783178
  },
  {
    "name": "国共",
    "weight": 2.449489742783178
  },
  {
    "name": "中央委员会",
    "weight": 2.449489742783178
  },
  {
    "name": "香港",
    "weight": 2.449489742783178
  },
  {
    "name": "预旺县",
    "weight": 2.449489742783178
  },
  {
    "name": "日本帝国",
    "weight": 2.449489742783178
  },
  {
    "name": "河南",
    "weight": 2.449489742783178
  },
  {
    "name": "欧洲",
    "weight": 2.449489742783178
  },
  {
    "name": "察哈尔",
    "weight": 2.449489742783178
  },
  {
    "name": "渭河",
    "weight": 2.449489742783178
  },
  {
    "name": "瓦窑堡",
    "weight": 2.449489742783178
  },
  {
    "name": "安塞",
    "weight": 2.449489742783178
  },
  {
    "name": "林伯渠",
    "weight": 2.23606797749979
  },
  {
    "name": "穆斯林",
    "weight": 2.23606797749979
  },
  {
    "name": "希特勒",
    "weight": 2.23606797749979
  },
  {
    "name": "邵力子",
    "weight": 2.23606797749979
  },
  {
    "name": "张少帅",
    "weight": 2.23606797749979
  },
  {
    "name": "王牧师",
    "weight": 2.23606797749979
  },
  {
    "name": "邓发",
    "weight": 2.23606797749979
  },
  {
    "name": "洛甫",
    "weight": 2.23606797749979
  },
  {
    "name": "吴亮平",
    "weight": 2.23606797749979
  },
  {
    "name": "反共",
    "weight": 2.23606797749979
  },
  {
    "name": "司令部",
    "weight": 2.23606797749979
  },
  {
    "name": "国民军",
    "weight": 2.23606797749979
  },
  {
    "name": "工会",
    "weight": 2.23606797749979
  },
  {
    "name": "纽约",
    "weight": 2.23606797749979
  },
  {
    "name": "西行",
    "weight": 2.23606797749979
  },
  {
    "name": "远东",
    "weight": 2.23606797749979
  },
  {
    "name": "西北苏区",
    "weight": 2.23606797749979
  },
  {
    "name": "地球",
    "weight": 2.23606797749979
  },
  {
    "name": "太阳",
    "weight": 2.23606797749979
  },
  {
    "name": "苏维埃共和国",
    "weight": 2.23606797749979
  },
  {
    "name": "西班牙",
    "weight": 2.23606797749979
  },
  {
    "name": "中华苏维埃共和国",
    "weight": 2.23606797749979
  },
  {
    "name": "支那",
    "weight": 2.23606797749979
  },
  {
    "name": "董乐山",
    "weight": 2
  },
  {
    "name": "鲁迅",
    "weight": 2
  },
  {
    "name": "保安",
    "weight": 2
  },
  {
    "name": "冯·西克特",
    "weight": 2
  },
  {
    "name": "孔子",
    "weight": 2
  },
  {
    "name": "李克农",
    "weight": 2
  },
  {
    "name": "杨开慧",
    "weight": 2
  },
  {
    "name": "杨昌济",
    "weight": 2
  },
  {
    "name": "太阳报",
    "weight": 2
  },
  {
    "name": "RED  STAR  OVER  CHINA",
    "weight": 2
  },
  {
    "name": "参谋部",
    "weight": 2
  },
  {
    "name": "第二十军",
    "weight": 2
  },
  {
    "name": "国会",
    "weight": 2
  },
  {
    "name": "内蒙古",
    "weight": 2
  },
  {
    "name": "台湾",
    "weight": 2
  },
  {
    "name": "瑞士",
    "weight": 2
  },
  {
    "name": "大陆",
    "weight": 2
  },
  {
    "name": "东京",
    "weight": 2
  },
  {
    "name": "亚洲",
    "weight": 2
  },
  {
    "name": "华中",
    "weight": 2
  },
  {
    "name": "百家坪",
    "weight": 2
  },
  {
    "name": "巴黎",
    "weight": 2
  },
  {
    "name": "陆国",
    "weight": 2
  },
  {
    "name": "北洋",
    "weight": 2
  },
  {
    "name": "华南",
    "weight": 2
  },
  {
    "name": "法西斯",
    "weight": 1.7320508075688772
  },
  {
    "name": "胡适",
    "weight": 1.7320508075688772
  },
  {
    "name": "张作霖",
    "weight": 1.7320508075688772
  },
  {
    "name": "布留赫尔",
    "weight": 1.7320508075688772
  },
  {
    "name": "张发奎",
    "weight": 1.7320508075688772
  },
  {
    "name": "卢梭",
    "weight": 1.7320508075688772
  },
  {
    "name": "谭延阁",
    "weight": 1.7320508075688772
  },
  {
    "name": "密勒氏评论报",
    "weight": 1.7320508075688772
  },
  {
    "name": "红军游击队",
    "weight": 1.7320508075688772
  },
  {
    "name": "贫民会",
    "weight": 1.7320508075688772
  },
  {
    "name": "革命军事委员会",
    "weight": 1.7320508075688772
  },
  {
    "name": "红军骑兵",
    "weight": 1.7320508075688772
  },
  {
    "name": "红色游击队",
    "weight": 1.7320508075688772
  },
  {
    "name": "抗日义勇军",
    "weight": 1.7320508075688772
  },
  {
    "name": "空军",
    "weight": 1.7320508075688772
  },
  {
    "name": "铁军",
    "weight": 1.7320508075688772
  },
  {
    "name": "红大",
    "weight": 1.7320508075688772
  },
  {
    "name": "同盟会",
    "weight": 1.7320508075688772
  },
  {
    "name": "南京政府",
    "weight": 1.7320508075688772
  },
  {
    "name": "朝鲜",
    "weight": 1.7320508075688772
  },
  {
    "name": "志丹县",
    "weight": 1.7320508075688772
  },
  {
    "name": "红色",
    "weight": 1.7320508075688772
  },
  {
    "name": "外蒙古",
    "weight": 1.7320508075688772
  },
  {
    "name": "满洲国",
    "weight": 1.7320508075688772
  },
  {
    "name": "山西省",
    "weight": 1.7320508075688772
  },
  {
    "name": "汕头",
    "weight": 1.7320508075688772
  },
  {
    "name": "云南府",
    "weight": 1.7320508075688772
  },
  {
    "name": "江西苏区",
    "weight": 1.7320508075688772
  },
  {
    "name": "苏俄",
    "weight": 1.7320508075688772
  },
  {
    "name": "比利时",
    "weight": 1.7320508075688772
  },
  {
    "name": "加拿大",
    "weight": 1.7320508075688772
  },
  {
    "name": "东三省",
    "weight": 1.7320508075688772
  },
  {
    "name": "阿比西尼亚",
    "weight": 1.7320508075688772
  },
  {
    "name": "湖北省",
    "weight": 1.7320508075688772
  },
  {
    "name": "刘静",
    "weight": 1.4142135623730951
  },
  {
    "name": "史沫特莱",
    "weight": 1.4142135623730951
  }
]

export default fakedata